FKDD_COPY_DIFF_3_2026-02-14/Documents/БТ_ПлановыеПоказатели.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>БТ_ПлановыеПоказатели</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Показатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БТ_Показатели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПланПоДням</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Documents/БТ_ПлановыеПоказатели/Ext/ObjectModule.bsl
Функция ЕстьДругойДокумент()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БТ_ПлановыеПоказатели.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.БТ_ПлановыеПоказатели КАК БТ_ПлановыеПоказатели
		|ГДЕ
		|	БТ_ПлановыеПоказатели.Организация = &Организация
		|	И БТ_ПлановыеПоказатели.Период = &Период
		|	И БТ_ПлановыеПоказатели.Ссылка <> &Ссылка
		|	И БТ_ПлановыеПоказатели.Подразделение = &Подразделение";
	
	Запрос.УстановитьПараметр("Организация", Организация); 
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат не РезультатЗапроса.Пустой();
	
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЕстьДругойДокумент() Тогда
		
		Сообщить("В базе уже есть документ, за выбранный период по выбранной организации, запись отменена!");
		Отказ = истина;
		Возврат;
		
	КонецЕсли;
	
	Если не РежимЗаписи = РежимЗаписиДокумента.Запись Тогда
		
		Если не Документы.БТ_ПлановыеПоказатели.ВыгрузитьПоказатели(ЭтотОбъект,РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения) Тогда
			
			отказ = истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	Документы.БТ_ПлановыеПоказатели.ВыгрузитьПоказатели(ЭтотОбъект,истина);
КонецПроцедуры
